; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-3-5-7)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	p0-1 - location
	p0-2 - location
	p1-6 - location
	p2-0 - location
	p2-3 - location
	p2-4 - location
	p2-8 - location
	p3-6 - location
	p4-1 - location
	p4-7 - location
	p4-9 - location
	p6-5 - location
	p7-1 - location
	p7-3 - location
	p7-6 - location
	p7-8 - location
	p7-10 - location
	p8-0 - location
	p9-3 - location
	p10-4 - location
	p10-6 - location
	p10-7 - location
	p10-8 - location
	)
	(:init
	(at driver1 s4)
	(at driver2 s3)
	(at driver3 s5)
	(at truck1 s8)
	(empty truck1)
	(at truck2 s10)
	(empty truck2)
	(at truck3 s8)
	(empty truck3)
	(at truck4 s10)
	(empty truck4)
	(at truck5 s0)
	(empty truck5)
	(at package1 s6)
	(at package2 s7)
	(at package3 s7)
	(at package4 s6)
	(at package5 s1)
	(at package6 s1)
	(at package7 s4)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 54)
	(= (time-to-walk p0-1 s0) 54)
	(= (time-to-walk s1 p0-1) 14)
	(= (time-to-walk p0-1 s1) 14)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(= (time-to-walk s0 p0-2) 73)
	(= (time-to-walk p0-2 s0) 73)
	(= (time-to-walk s2 p0-2) 34)
	(= (time-to-walk p0-2 s2) 34)
	(path s1 p1-6)
	(path p1-6 s1)
	(path s6 p1-6)
	(path p1-6 s6)
	(= (time-to-walk s1 p1-6) 10)
	(= (time-to-walk p1-6 s1) 10)
	(= (time-to-walk s6 p1-6) 28)
	(= (time-to-walk p1-6 s6) 28)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(= (time-to-walk s2 p2-3) 12)
	(= (time-to-walk p2-3 s2) 12)
	(= (time-to-walk s3 p2-3) 16)
	(= (time-to-walk p2-3 s3) 16)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(= (time-to-walk s2 p2-4) 65)
	(= (time-to-walk p2-4 s2) 65)
	(= (time-to-walk s4 p2-4) 69)
	(= (time-to-walk p2-4 s4) 69)
	(path s2 p2-8)
	(path p2-8 s2)
	(path s8 p2-8)
	(path p2-8 s8)
	(= (time-to-walk s2 p2-8) 74)
	(= (time-to-walk p2-8 s2) 74)
	(= (time-to-walk s8 p2-8) 97)
	(= (time-to-walk p2-8 s8) 97)
	(path s3 p3-6)
	(path p3-6 s3)
	(path s6 p3-6)
	(path p3-6 s6)
	(= (time-to-walk s3 p3-6) 40)
	(= (time-to-walk p3-6 s3) 40)
	(= (time-to-walk s6 p3-6) 40)
	(= (time-to-walk p3-6 s6) 40)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(= (time-to-walk s4 p4-1) 34)
	(= (time-to-walk p4-1 s4) 34)
	(= (time-to-walk s1 p4-1) 93)
	(= (time-to-walk p4-1 s1) 93)
	(path s4 p4-7)
	(path p4-7 s4)
	(path s7 p4-7)
	(path p4-7 s7)
	(= (time-to-walk s4 p4-7) 8)
	(= (time-to-walk p4-7 s4) 8)
	(= (time-to-walk s7 p4-7) 13)
	(= (time-to-walk p4-7 s7) 13)
	(path s4 p4-9)
	(path p4-9 s4)
	(path s9 p4-9)
	(path p4-9 s9)
	(= (time-to-walk s4 p4-9) 28)
	(= (time-to-walk p4-9 s4) 28)
	(= (time-to-walk s9 p4-9) 65)
	(= (time-to-walk p4-9 s9) 65)
	(path s6 p6-5)
	(path p6-5 s6)
	(path s5 p6-5)
	(path p6-5 s5)
	(= (time-to-walk s6 p6-5) 24)
	(= (time-to-walk p6-5 s6) 24)
	(= (time-to-walk s5 p6-5) 83)
	(= (time-to-walk p6-5 s5) 83)
	(path s7 p7-1)
	(path p7-1 s7)
	(path s1 p7-1)
	(path p7-1 s1)
	(= (time-to-walk s7 p7-1) 83)
	(= (time-to-walk p7-1 s7) 83)
	(= (time-to-walk s1 p7-1) 83)
	(= (time-to-walk p7-1 s1) 83)
	(path s7 p7-3)
	(path p7-3 s7)
	(path s3 p7-3)
	(path p7-3 s3)
	(= (time-to-walk s7 p7-3) 26)
	(= (time-to-walk p7-3 s7) 26)
	(= (time-to-walk s3 p7-3) 97)
	(= (time-to-walk p7-3 s3) 97)
	(path s7 p7-6)
	(path p7-6 s7)
	(path s6 p7-6)
	(path p7-6 s6)
	(= (time-to-walk s7 p7-6) 19)
	(= (time-to-walk p7-6 s7) 19)
	(= (time-to-walk s6 p7-6) 15)
	(= (time-to-walk p7-6 s6) 15)
	(path s7 p7-8)
	(path p7-8 s7)
	(path s8 p7-8)
	(path p7-8 s8)
	(= (time-to-walk s7 p7-8) 34)
	(= (time-to-walk p7-8 s7) 34)
	(= (time-to-walk s8 p7-8) 54)
	(= (time-to-walk p7-8 s8) 54)
	(path s7 p7-10)
	(path p7-10 s7)
	(path s10 p7-10)
	(path p7-10 s10)
	(= (time-to-walk s7 p7-10) 71)
	(= (time-to-walk p7-10 s7) 71)
	(= (time-to-walk s10 p7-10) 88)
	(= (time-to-walk p7-10 s10) 88)
	(path s8 p8-0)
	(path p8-0 s8)
	(path s0 p8-0)
	(path p8-0 s0)
	(= (time-to-walk s8 p8-0) 67)
	(= (time-to-walk p8-0 s8) 67)
	(= (time-to-walk s0 p8-0) 44)
	(= (time-to-walk p8-0 s0) 44)
	(path s9 p9-3)
	(path p9-3 s9)
	(path s3 p9-3)
	(path p9-3 s3)
	(= (time-to-walk s9 p9-3) 21)
	(= (time-to-walk p9-3 s9) 21)
	(= (time-to-walk s3 p9-3) 77)
	(= (time-to-walk p9-3 s3) 77)
	(path s10 p10-4)
	(path p10-4 s10)
	(path s4 p10-4)
	(path p10-4 s4)
	(= (time-to-walk s10 p10-4) 72)
	(= (time-to-walk p10-4 s10) 72)
	(= (time-to-walk s4 p10-4) 32)
	(= (time-to-walk p10-4 s4) 32)
	(path s10 p10-6)
	(path p10-6 s10)
	(path s6 p10-6)
	(path p10-6 s6)
	(= (time-to-walk s10 p10-6) 93)
	(= (time-to-walk p10-6 s10) 93)
	(= (time-to-walk s6 p10-6) 36)
	(= (time-to-walk p10-6 s6) 36)
	(path s10 p10-8)
	(path p10-8 s10)
	(path s8 p10-8)
	(path p10-8 s8)
	(= (time-to-walk s10 p10-8) 1)
	(= (time-to-walk p10-8 s10) 1)
	(= (time-to-walk s8 p10-8) 67)
	(= (time-to-walk p10-8 s8) 67)
	(link s0 s5)
	(link s5 s0)
	(= (time-to-drive s0 s5) 33)
	(= (time-to-drive s5 s0) 33)
	(link s0 s8)
	(link s8 s0)
	(= (time-to-drive s0 s8) 41)
	(= (time-to-drive s8 s0) 41)
	(link s0 s9)
	(link s9 s0)
	(= (time-to-drive s0 s9) 7)
	(= (time-to-drive s9 s0) 7)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 67)
	(= (time-to-drive s0 s1) 67)
	(link s1 s7)
	(link s7 s1)
	(= (time-to-drive s1 s7) 33)
	(= (time-to-drive s7 s1) 33)
	(link s1 s8)
	(link s8 s1)
	(= (time-to-drive s1 s8) 14)
	(= (time-to-drive s8 s1) 14)
	(link s1 s10)
	(link s10 s1)
	(= (time-to-drive s1 s10) 79)
	(= (time-to-drive s10 s1) 79)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 61)
	(= (time-to-drive s3 s2) 61)
	(link s2 s7)
	(link s7 s2)
	(= (time-to-drive s2 s7) 78)
	(= (time-to-drive s7 s2) 78)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 3)
	(= (time-to-drive s4 s3) 3)
	(link s3 s6)
	(link s6 s3)
	(= (time-to-drive s3 s6) 43)
	(= (time-to-drive s6 s3) 43)
	(link s3 s8)
	(link s8 s3)
	(= (time-to-drive s3 s8) 61)
	(= (time-to-drive s8 s3) 61)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 86)
	(= (time-to-drive s5 s4) 86)
	(link s4 s8)
	(link s8 s4)
	(= (time-to-drive s4 s8) 69)
	(= (time-to-drive s8 s4) 69)
	(link s4 s10)
	(link s10 s4)
	(= (time-to-drive s4 s10) 57)
	(= (time-to-drive s10 s4) 57)
	(link s6 s1)
	(link s1 s6)
	(= (time-to-drive s6 s1) 4)
	(= (time-to-drive s1 s6) 4)
	(link s6 s7)
	(link s7 s6)
	(= (time-to-drive s6 s7) 84)
	(= (time-to-drive s7 s6) 84)
	(link s7 s0)
	(link s0 s7)
	(= (time-to-drive s7 s0) 90)
	(= (time-to-drive s0 s7) 90)
	(link s7 s8)
	(link s8 s7)
	(= (time-to-drive s7 s8) 57)
	(= (time-to-drive s8 s7) 57)
	(link s8 s5)
	(link s5 s8)
	(= (time-to-drive s8 s5) 55)
	(= (time-to-drive s5 s8) 55)
	(link s9 s2)
	(link s2 s9)
	(= (time-to-drive s9 s2) 77)
	(= (time-to-drive s2 s9) 77)
	(link s9 s3)
	(link s3 s9)
	(= (time-to-drive s9 s3) 24)
	(= (time-to-drive s3 s9) 24)
	(link s9 s8)
	(link s8 s9)
	(= (time-to-drive s9 s8) 98)
	(= (time-to-drive s8 s9) 98)
	(link s9 s10)
	(link s10 s9)
	(= (time-to-drive s9 s10) 97)
	(= (time-to-drive s10 s9) 97)
	(link s10 s2)
	(link s2 s10)
	(= (time-to-drive s10 s2) 1)
	(= (time-to-drive s2 s10) 1)
	(link s10 s3)
	(link s3 s10)
	(= (time-to-drive s10 s3) 69)
	(= (time-to-drive s3 s10) 69)
	(link s10 s7)
	(link s7 s10)
	(= (time-to-drive s10 s7) 29)
	(= (time-to-drive s7 s10) 29)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s9)
	(at driver2 s2)
	(at driver3 s9)
	(at truck3 s1)
	(at truck4 s6)
	(at truck5 s4)
	(at package1 s3)
	(at package2 s4)
	(at package3 s8)
	(at package4 s1)
	(at package5 s6)
	(at package6 s3)
	(at package7 s3)
	))

(:metric minimize (+ (+ (* 4  (total-time)) (* 1  (driven))) (* 2  (walked))))

)

; plan
1. (walk driver1 s4 p10-4)
   deleted: (at driver1 s4)
   added: (at driver1 p10-4)
   changed: (walked) from 0 to 32
   goals met: 0 of 13
2. (walk driver1 p10-4 s10)
   deleted: (at driver1 p10-4)
   added: (at driver1 s10)
   changed: (walked) from 32 to 104
   goals met: 0 of 13
3. (board-truck driver1 truck4 s10)
   deleted: (at driver1 s10) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 0 of 13
4. (drive-truck truck4 s10 s9 driver1)
   deleted: (at truck4 s10)
   added: (at truck4 s9)
   changed: (driven) from 0 to 97
   goals met: 0 of 13
5. (drive-truck truck4 s9 s0 driver1)
   deleted: (at truck4 s9)
   added: (at truck4 s0)
   changed: (driven) from 97 to 104
   goals met: 0 of 13
6. (walk driver2 s3 p2-3)
   deleted: (at driver2 s3)
   added: (at driver2 p2-3)
   changed: (walked) from 104 to 120
   goals met: 0 of 13
7. (walk driver2 p2-3 s2)
   deleted: (at driver2 p2-3)
   added: (at driver2 s2)
   changed: (walked) from 120 to 132
   goals met: 1 of 13
8. (drive-truck truck4 s0 s1 driver1)
   deleted: (at truck4 s0)
   added: (at truck4 s1)
   changed: (driven) from 104 to 171
   goals met: 1 of 13
9. (load-truck package6 truck4 s1)
   deleted: (at package6 s1)
   added: (in package6 truck4)
   goals met: 1 of 13
10. (drive-truck truck4 s1 s7 driver1)
   deleted: (at truck4 s1)
   added: (at truck4 s7)
   changed: (driven) from 171 to 204
   goals met: 1 of 13
11. (load-truck package3 truck4 s7)
   deleted: (at package3 s7)
   added: (in package3 truck4)
   goals met: 1 of 13
12. (drive-truck truck4 s7 s8 driver1)
   deleted: (at truck4 s7)
   added: (at truck4 s8)
   changed: (driven) from 204 to 261
   goals met: 1 of 13
13. (unload-truck package3 truck4 s8)
   deleted: (in package3 truck4)
   added: (at package3 s8)
   goals met: 2 of 13
14. (drive-truck truck4 s8 s1 driver1)
   deleted: (at truck4 s8)
   added: (at truck4 s1)
   changed: (driven) from 261 to 275
   goals met: 2 of 13
15. (load-truck package5 truck4 s1)
   deleted: (at package5 s1)
   added: (in package5 truck4)
   goals met: 2 of 13
16. (drive-truck truck4 s1 s0 driver1)
   deleted: (at truck4 s1)
   added: (at truck4 s0)
   changed: (driven) from 275 to 342
   goals met: 2 of 13
17. (walk driver2 s2 p0-2)
   deleted: (at driver2 s2)
   added: (at driver2 p0-2)
   changed: (walked) from 132 to 166
   goals met: 1 of 13
18. (drive-truck truck4 s0 s8 driver1)
   deleted: (at truck4 s0)
   added: (at truck4 s8)
   changed: (driven) from 342 to 383
   goals met: 1 of 13
19. (drive-truck truck4 s8 s4 driver1)
   deleted: (at truck4 s8)
   added: (at truck4 s4)
   changed: (driven) from 383 to 452
   goals met: 1 of 13
20. (load-truck package7 truck4 s4)
   deleted: (at package7 s4)
   added: (in package7 truck4)
   goals met: 1 of 13
21. (drive-truck truck4 s4 s3 driver1)
   deleted: (at truck4 s4)
   added: (at truck4 s3)
   changed: (driven) from 452 to 455
   goals met: 1 of 13
22. (drive-truck truck4 s3 s6 driver1)
   deleted: (at truck4 s3)
   added: (at truck4 s6)
   changed: (driven) from 455 to 498
   goals met: 2 of 13
23. (unload-truck package5 truck4 s6)
   deleted: (in package5 truck4)
   added: (at package5 s6)
   goals met: 3 of 13
24. (load-truck package1 truck4 s6)
   deleted: (at package1 s6)
   added: (in package1 truck4)
   goals met: 3 of 13
25. (load-truck package4 truck4 s6)
   deleted: (at package4 s6)
   added: (in package4 truck4)
   goals met: 3 of 13
26. (walk driver2 p0-2 s0)
   deleted: (at driver2 p0-2)
   added: (at driver2 s0)
   changed: (walked) from 166 to 239
   goals met: 3 of 13
27. (board-truck driver2 truck5 s0)
   deleted: (at driver2 s0) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 3 of 13
28. (drive-truck truck5 s0 s8 driver2)
   deleted: (at truck5 s0)
   added: (at truck5 s8)
   changed: (driven) from 498 to 539
   goals met: 3 of 13
29. (drive-truck truck4 s6 s3 driver1)
   deleted: (at truck4 s6)
   added: (at truck4 s3)
   changed: (driven) from 539 to 582
   goals met: 2 of 13
30. (unload-truck package1 truck4 s3)
   deleted: (in package1 truck4)
   added: (at package1 s3)
   goals met: 3 of 13
31. (disembark-truck driver2 truck5 s8)
   deleted: (driving driver2 truck5)
   added: (at driver2 s8) (empty truck5)
   goals met: 3 of 13
32. (unload-truck package6 truck4 s3)
   deleted: (in package6 truck4)
   added: (at package6 s3)
   goals met: 4 of 13
33. (unload-truck package7 truck4 s3)
   deleted: (in package7 truck4)
   added: (at package7 s3)
   goals met: 5 of 13
34. (drive-truck truck4 s3 s6 driver1)
   deleted: (at truck4 s3)
   added: (at truck4 s6)
   changed: (driven) from 582 to 625
   goals met: 6 of 13
35. (walk driver2 s8 p2-8)
   deleted: (at driver2 s8)
   added: (at driver2 p2-8)
   changed: (walked) from 239 to 336
   goals met: 6 of 13
36. (walk driver3 s5 p6-5)
   deleted: (at driver3 s5)
   added: (at driver3 p6-5)
   changed: (walked) from 336 to 419
   goals met: 6 of 13
37. (walk driver3 p6-5 s6)
   deleted: (at driver3 p6-5)
   added: (at driver3 s6)
   changed: (walked) from 419 to 443
   goals met: 6 of 13
38. (drive-truck truck4 s6 s7 driver1)
   deleted: (at truck4 s6)
   added: (at truck4 s7)
   changed: (driven) from 625 to 709
   goals met: 5 of 13
39. (load-truck package2 truck4 s7)
   deleted: (at package2 s7)
   added: (in package2 truck4)
   goals met: 5 of 13
40. (drive-truck truck4 s7 s1 driver1)
   deleted: (at truck4 s7)
   added: (at truck4 s1)
   changed: (driven) from 709 to 742
   goals met: 5 of 13
41. (unload-truck package4 truck4 s1)
   deleted: (in package4 truck4)
   added: (at package4 s1)
   goals met: 6 of 13
42. (drive-truck truck4 s1 s6 driver1)
   deleted: (at truck4 s1)
   added: (at truck4 s6)
   changed: (driven) from 742 to 746
   goals met: 7 of 13
43. (drive-truck truck4 s6 s3 driver1)
   deleted: (at truck4 s6)
   added: (at truck4 s3)
   changed: (driven) from 746 to 789
   goals met: 6 of 13
44. (drive-truck truck4 s3 s9 driver1)
   deleted: (at truck4 s3)
   added: (at truck4 s9)
   changed: (driven) from 789 to 813
   goals met: 6 of 13
45. (walk driver3 s6 p3-6)
   deleted: (at driver3 s6)
   added: (at driver3 p3-6)
   changed: (walked) from 443 to 483
   goals met: 6 of 13
46. (drive-truck truck4 s9 s3 driver1)
   deleted: (at truck4 s9)
   added: (at truck4 s3)
   changed: (driven) from 813 to 837
   goals met: 6 of 13
47. (walk driver3 p3-6 s3)
   deleted: (at driver3 p3-6)
   added: (at driver3 s3)
   changed: (walked) from 483 to 523
   goals met: 6 of 13
48. (walk driver3 s3 p9-3)
   deleted: (at driver3 s3)
   added: (at driver3 p9-3)
   changed: (walked) from 523 to 600
   goals met: 6 of 13
49. (walk driver3 p9-3 s9)
   deleted: (at driver3 p9-3)
   added: (at driver3 s9)
   changed: (walked) from 600 to 621
   goals met: 7 of 13
50. (drive-truck truck4 s3 s4 driver1)
   deleted: (at truck4 s3)
   added: (at truck4 s4)
   changed: (driven) from 837 to 840
   goals met: 7 of 13
51. (unload-truck package2 truck4 s4)
   deleted: (in package2 truck4)
   added: (at package2 s4)
   goals met: 8 of 13
52. (drive-truck truck4 s4 s3 driver1)
   deleted: (at truck4 s4)
   added: (at truck4 s3)
   changed: (driven) from 840 to 843
   goals met: 8 of 13
53. (drive-truck truck4 s3 s9 driver1)
   deleted: (at truck4 s3)
   added: (at truck4 s9)
   changed: (driven) from 843 to 867
   goals met: 8 of 13
54. (disembark-truck driver1 truck4 s9)
   deleted: (driving driver1 truck4)
   added: (at driver1 s9) (empty truck4)
   goals met: 9 of 13
55. (walk driver2 p2-8 s8)
   deleted: (at driver2 p2-8)
   added: (at driver2 s8)
   changed: (walked) from 621 to 718
   goals met: 9 of 13
56. (board-truck driver2 truck5 s8)
   deleted: (at driver2 s8) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 9 of 13
57. (drive-truck truck5 s8 s4 driver2)
   deleted: (at truck5 s8)
   added: (at truck5 s4)
   changed: (driven) from 867 to 936
   goals met: 10 of 13
58. (disembark-truck driver2 truck5 s4)
   deleted: (driving driver2 truck5)
   added: (at driver2 s4) (empty truck5)
   goals met: 10 of 13
59. (walk driver2 s4 p2-4)
   deleted: (at driver2 s4)
   added: (at driver2 p2-4)
   changed: (walked) from 718 to 787
   goals met: 10 of 13
60. (board-truck driver1 truck4 s9)
   deleted: (at driver1 s9) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 9 of 13
61. (drive-truck truck4 s9 s8 driver1)
   deleted: (at truck4 s9)
   added: (at truck4 s8)
   changed: (driven) from 936 to 1034
   goals met: 9 of 13
62. (walk driver2 p2-4 s2)
   deleted: (at driver2 p2-4)
   added: (at driver2 s2)
   changed: (walked) from 787 to 852
   goals met: 10 of 13
63. (drive-truck truck4 s8 s1 driver1)
   deleted: (at truck4 s8)
   added: (at truck4 s1)
   changed: (driven) from 1034 to 1048
   goals met: 10 of 13
64. (drive-truck truck4 s1 s10 driver1)
   deleted: (at truck4 s1)
   added: (at truck4 s10)
   changed: (driven) from 1048 to 1127
   goals met: 10 of 13
65. (walk driver2 s2 p2-8)
   deleted: (at driver2 s2)
   added: (at driver2 p2-8)
   changed: (walked) from 852 to 926
   goals met: 9 of 13
66. (drive-truck truck4 s10 s1 driver1)
   deleted: (at truck4 s10)
   added: (at truck4 s1)
   changed: (driven) from 1127 to 1206
   goals met: 9 of 13
67. (walk driver2 p2-8 s8)
   deleted: (at driver2 p2-8)
   added: (at driver2 s8)
   changed: (walked) from 926 to 1023
   goals met: 9 of 13
68. (drive-truck truck4 s1 s0 driver1)
   deleted: (at truck4 s1)
   added: (at truck4 s0)
   changed: (driven) from 1206 to 1273
   goals met: 9 of 13
69. (board-truck driver2 truck3 s8)
   deleted: (at driver2 s8) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 9 of 13
70. (drive-truck truck4 s0 s7 driver1)
   deleted: (at truck4 s0)
   added: (at truck4 s7)
   changed: (driven) from 1273 to 1363
   goals met: 9 of 13
71. (drive-truck truck3 s8 s1 driver2)
   deleted: (at truck3 s8)
   added: (at truck3 s1)
   changed: (driven) from 1363 to 1377
   goals met: 10 of 13
72. (disembark-truck driver2 truck3 s1)
   deleted: (driving driver2 truck3)
   added: (at driver2 s1) (empty truck3)
   goals met: 10 of 13
73. (drive-truck truck4 s7 s6 driver1)
   deleted: (at truck4 s7)
   added: (at truck4 s6)
   changed: (driven) from 1377 to 1461
   goals met: 11 of 13
74. (disembark-truck driver1 truck4 s6)
   deleted: (driving driver1 truck4)
   added: (at driver1 s6) (empty truck4)
   goals met: 11 of 13
75. (walk driver1 s6 p3-6)
   deleted: (at driver1 s6)
   added: (at driver1 p3-6)
   changed: (walked) from 1023 to 1063
   goals met: 11 of 13
76. (walk driver1 p3-6 s3)
   deleted: (at driver1 p3-6)
   added: (at driver1 s3)
   changed: (walked) from 1063 to 1103
   goals met: 11 of 13
77. (walk driver2 s1 p0-1)
   deleted: (at driver2 s1)
   added: (at driver2 p0-1)
   changed: (walked) from 1103 to 1117
   goals met: 11 of 13
78. (walk driver1 s3 p9-3)
   deleted: (at driver1 s3)
   added: (at driver1 p9-3)
   changed: (walked) from 1117 to 1194
   goals met: 11 of 13
79. (walk driver1 p9-3 s9)
   deleted: (at driver1 p9-3)
   added: (at driver1 s9)
   changed: (walked) from 1194 to 1215
   goals met: 12 of 13
80. (walk driver2 p0-1 s0)
   deleted: (at driver2 p0-1)
   added: (at driver2 s0)
   changed: (walked) from 1215 to 1269
   goals met: 12 of 13
81. (walk driver2 s0 p0-2)
   deleted: (at driver2 s0)
   added: (at driver2 p0-2)
   changed: (walked) from 1269 to 1342
   goals met: 12 of 13
82. (walk driver2 p0-2 s2)
   deleted: (at driver2 p0-2)
   added: (at driver2 s2)
   changed: (walked) from 1342 to 1376
   goals met: 13 of 13
